In [20]:
import pandas as pd

In [21]:
data = {'Employee ID': [20005, 20006, 20007, 20008, 20009, 20010, 20011, 20012],
        'Date of Join': ['05-01-2019', '10-01-2019', '01-02-2019', '05-02-2019', '01-03-2019', '02-03-2019', '02-04-2019', '05-04-2019']}

df = pd.DataFrame(data)
df

   Employee ID Date of Join
0        20005   05-01-2019
1        20006   10-01-2019
2        20007   01-02-2019
3        20008   05-02-2019
4        20009   01-03-2019
5        20010   02-03-2019
6        20011   02-04-2019
7        20012   05-04-2019

In [22]:
df['Date of Join'] = pd.to_datetime(df['Date of Join'], format='%d-%m-%Y')

In [23]:
df['Year'] = df['Date of Join'].dt.year
df['Month'] = df['Date of Join'].dt.month
df['Day'] = df['Date of Join'].dt.day

In [24]:
df = df[['Employee ID', 'Day', 'Month', 'Year']]    #Reorder columns

In [25]:
df

   Employee ID  Day  Month  Year
0        20005    5      1  2019
1        20006   10      1  2019
2        20007    1      2  2019
3        20008    5      2  2019
4        20009    1      3  2019
5        20010    2      3  2019
6        20011    2      4  2019
7        20012    5      4  2019